BetterBibTeX.startup.waitingForZotero=Warten auf Zotero-Datenbank
BetterBibTeX.startup.waitingForTranslators=Warten auf Zotero-\u00dcbersetzer
BetterBibTeX.startup.loadingKeys=Lade Zitierschl\u00fcssel
BetterBibTeX.startup.autoExport.load=Initialisiere Auto-Export
BetterBibTeX.startup.autoExport=Beginne automatischen Export
BetterBibTeX.startup.keyManager=Starte Schl\u00fcsselverwaltung
BetterBibTeX.startup.serializationCache=Starte Serialisierungs-Cache
BetterBibTeX.startup.journalAbbrev=Lade Zeitschriften-Abk\u00fcrzer
BetterBibTeX.startup.dbUpgrade=Datenbankbereinigung {n}/{total}...
BetterBibTeX.startup.dbUpgrade.saving=Datenbank-Bereinigung, speichern...
BetterBibTeX.startup.dbUpgrade.notEditable={n} Items nicht aktualisiert, weil sie schreibgesch\u00fctzt sind
BetterBibTeX.startup.installingTranslators=Installiere kompilierte Export-Module
BetterBibTeX.startup.installingTranslators.new=Better BibTex\: neue \u00dcbersetzer installiert
BetterBibTeX.startup.installingTranslators.new.DnD=Neue Better-BibTex-\u00dcbersetzer wurden installiert. Wenn Sie diese f\u00fcr Drag-and-Drop verwenden wollen (z. B. um per Drag-and-Drop Zitierschl\u00fcssel oder Zitate zu \u00fcbernehmen), ist ein einmaliger Neustart notwendig, um sie zu aktivieren.
BetterBibTeX.startup.installingTranslators.new.dontAskAgain=Nicht nochmals fragen

BetterBibTeX.auxScan.title=Markiere zitierte Elemente aus der AUX-Datei
BetterBibTeX.auxScan.prompt=Name der Markierung

BetterBibTeX.texstudio.notfound=TeXstudio nicht gefunden in {path}

Translate.error.target.notaFile={path} existiert, ist aber keine Datei
Translate.error.target.noParent={path} hat kein \u00fcbergeordnetes Verzeichnis

Preferences.auto-export.type.collection=Sammlung
Preferences.auto-export.type.library=Bibliothek
Preferences.auto-export.status.scheduled=geplant
Preferences.auto-export.status.running=l\u00e4uft
Preferences.auto-export.status.done=fertig
Preferences.auto-export.status.error=Fehler
Preferences.auto-export.git.message={type} aktualisiert durch Better BibTex for Zotero
AutoExport.too-long.title=Lang andauernder Auto-Export
AutoExport.too-long.body=Ihr {translator}-Auto-Export nach {path} dauerte {seconds} Sekunden. W\u00e4hrend Exporten jeglicher Art wird die Zotero-Benutzeroberfl\u00e4che gesperrt.
AutoExport.too-long.primeEnabled=Um die Auswirkungen von lang laufenden Auto-Exporten zu minimieren, wurde das Cache Priming aktiviert. Dies macht den Auto-Export langsamer, verk\u00fcrzt aber die Zeit, die Zotero einfriert, auf ein Minimum.
AutoExport.too-long.suggestIdle=Um die Auswirkungen von lang laufenden Auto-Exporten zu minimieren, sollten Sie den Auto-Export auf "Wenn unbesch\u00e4ftigt" statt auf "Bei Ver\u00e4nderung" setzen.
AutoExport.too-long.sorry=Sie haben bereits Cache Priming eingeschaltet und den Auto-Export auf "Wenn unbesch\u00e4ftigt" gesetzt. Ohne \u00c4nderungen in der Architektur von Zotero (https\://u.nu/27e9) kann nichts mehr getan werden.

exportOptions.keepUpdated=Halte aktuell
exportOptions.reminder=Sind Sie sicher, dass Sie nicht das ''{translator}''-Format wollen?

ErrorReport.better-bibtex.current=Sie verwenden Better BibTex Version {version}
ErrorReport.better-bibtex.latest=Die neueste Better-BibTeX-Version ist {version}
ErrorReport.better-bibtex.oom=Ihr System verf\u00fcgt aktuell nicht \u00fcber genug Speicher f\u00fcr die Zusammenstellung der Log-Datei. Bitte setzen Sie ''{preference}'' auf einen Wert, der niedriger ist als das aktuelle {limit}, starten Sie neu und versuchen Sie es erneut.

xpi.description=Macht Zotero f\u00fcr uns LaTex-Holdouts nutzbar.

DB.corrupt=Beim \u00d6ffnen der Datenbank ist ein Fehler aufgetreten
DB.corrupt.explanation=Beim \u00d6ffnen der Datenbank ist ein Fehler aufgetreten. Dies k\u00f6nnte bedeuten, dass Ihre Datenbank besch\u00e4digt ist. Der von Zotero gemeldete Fehler ist\: {error}.\n\nUm fortzufahren, w\u00e4hlen Sie eine der folgenden Optionen\:\n\n1. Lassen Sie Zotero versuchen, zu einem fr\u00fcheren Backup zur\u00fcckzukehren, indem Sie jetzt neu starten\n2. Setzen Sie die Better-BibTeX-Datenbank zur\u00fcck und fahren Sie fort\n3. Beenden Sie Zotero und wenden Sie sich an den Support, um eine Widerherstellung der Datenbank zu versuchen.\n\nDas Zur\u00fccksetzen erm\u00f6glicht es Ihnen fortzufahren, aber Ihre Zitierschl\u00fcssel werden neu generiert und der automatische Export muss neu eingerichtet werden. Ein Backup der besch\u00e4digten Datenbank wird zur Sicherheit aufbewahrt.
DB.corrupt.quit=Zotero jetzt beenden
DB.corrupt.restore=Zotero neu starten und Wiederherstellung versuchen
DB.corrupt.reset=Zur\u00fccksetzen und fortfahren
