{
  "`auth.auth.ea` / `edtr.edtr.ea`, `+initials`, `+<joinchar>`": "The last name of the first two authors, and \".ea\" if there are more than two.",
  "`auth.etal` / `edtr.etal`, `+initials`, `+<joinchar>`": "The last name of the first author, and the last name of the second author if there are two authors or \".etal\" if there are more than two.",
  "`authEtAl` / `edtrEtAl`, `+initials`, `+<joinchar>`": "The last name of the first author, and the last name of the second author if there are two authors or \"EtAl\" if there are more than two. This is similar to `auth.etal`. The difference is that the authors are not separated by \".\" and in case of more than 2 authors \"EtAl\" instead of \".etal\" is appended.",
  "`authForeIni` / `edtrForeIni`": "The forename initial of the first author.",
  "`authIniN` / `edtrIniN`, `+initials`, `+<joinchar>`": "The beginning of each author's last name, using no more than `N` characters.",
  "`authN_M` / `edtrN_M`, `+initials`, `+<joinchar>`": "The first `N` (default: all) characters of the `M`th (default: first) author's last name.",
  "`authorIni` / `edtrorIni`, `+initials`, `+<joinchar>`": "The first 5 characters of the first author's last name, and the last name initials of the remaining authors.",
  "`authorLastForeIni` / `edtrorLastForeIni`": "The forename initial of the last author.",
  "`authorLast` / `edtrorLast`, `+initials`, `+<joinchar>`": "The last name of the last author",
  "`authorsAlpha` / `editorsAlpha`, `+initials`, `+<joinchar>`": "Corresponds to the BibTeX style \"alpha\". One author: First three letters of the last name. Two to four authors: First letters of last names concatenated. More than four authors: First letters of last names of first three authors concatenated. \"+\" at the end.",
  "`authorsN` / `editorsN`, `+initials`, `+<joinchar>`": "The last name of up to N authors. If there are more authors, \"EtAl\" is appended.",
  "`authshort` / `edtrshort`, `+initials`, `+<joinchar>`": "The last name if one author is given; the first character of up to three authors' last names if more than one author is given. A plus character is added, if there are more than three authors.",
  "`date`": "The date of the publication",
  "`extra`": "A pseudo-field from the extra field. eg if you have `Original date: 1970` in your `extra` field, you can get it as `[extra=originalDate]`, or `tex.shortauthor: APA` which you could get with `[extra=tex.shortauthor]`",
  "`firstpage`": "The number of the first page of the publication (Caution: this will return the lowest number found in the pages field, since BibTeX allows `7,41,73--97` or `43+`.)",
  "`journal`": "returns the journal abbreviation, or, if not found, the journal title, If 'automatic journal abbreviation' is enabled in the BBT settings, it will use the same abbreviation filter Zotero uses in the wordprocessor integration. You might want to use the `abbr` filter on this.",
  "`keywordN`": "Tag number `N`",
  "`lastpage`": "The number of the last page of the publication (See the remark on `firstpage`)",
  "`library`": "returns the name of the shared group library, or nothing if the reference is in your personal library",
  "`month`": "the month of the publication",
  "`origdate`": "the original date of the publication",
  "`origyear`": "the original year of the publication",
  "`shorttitleN_M`": "The first `N` (default: 3) words of the title, apply capitalization to first `M` (default: 0) of those",
  "`shortyear`": "The last 2 digits of the publication year",
  "`title`": "Capitalize all the significant words of the title, and concatenate them. For example, `An awesome paper on JabRef` will become `AnAwesomePaperJabref`",
  "`veryshorttitleN_M`": "The first `N` (default: 1) words of the title, apply capitalization to first `M` (default: 0) of those",
  "`year`": "The year of the publication",
  "`zotero`": "Generates citation keys as the stock Zotero Bib(La)TeX export does. Note that this pattern inherits all the problems of the original Zotero citekey generation -- you should really only use this if you have existing papers that rely on this behavior."
}