{
  "`authAuthEa`(`creator`?: string='author', `initials`?: boolean=false, `joiner`?: string='.')": "The last name of the first two authors, and \".ea\" if there are more than two.",
  "`authEtAl`(`creator`?: string='author', `initials`?: boolean=false, `joiner`?: string=' ')": "The last name of the first author, and the last name of the second author if there are two authors or \"EtAl\" if there are more than two. This is similar to `auth.etal`. The difference is that the authors are not separated by \".\" and in case of more than 2 authors \"EtAl\" instead of \".etal\" is appended.",
  "`authEtal2`(`creator`?: string='author', `initials`?: boolean=false, `joiner`?: string='.')": "The last name of the first author, and the last name of the second author if there are two authors or \".etal\" if there are more than two.",
  "`authForeIni`(`creator`?: string='author')": "The forename initial of the first author.",
  "`authIni`(`creator`?: string='author', `initials`?: boolean=false, `joiner`?: string='.', `n`?: number)": "The beginning of each author's last name, using no more than `N` characters.",
  "`auth`(`creator`?: string='author', `initials`?: boolean=false, `n`?: number=0, `m`?: number=1)": "The last name of up to N authors. If there are more authors, \"EtAl\" is appended.   public $authors(n=0, creator: 'author' | 'editor' = 'author', initials=false, joiner=' ') {     return this.$author(n, creator, initials, undefined, 'EtAl', joiner)   }",
  "`authorIni`(`creator`?: string='author', `initials`?: boolean=false, `joiner`?: string='.')": "The first 5 characters of the first author's last name, and the last name initials of the remaining authors.",
  "`authorLastForeIni`(`creator`?: string='author')": "The forename initial of the last author.",
  "`authorLast`(`creator`?: string='author', `initials`?: boolean=false)": "The last name of the last author",
  "`authorsAlpha`(`creator`?: string='author', `initials`?: boolean=false, `joiner`?: string=' ')": "Corresponds to the BibTeX style \"alpha\". One author: First three letters of the last name. Two to four authors: First letters of last names concatenated. More than four authors: First letters of last names of first three authors concatenated. \"+\" at the end.",
  "`authors`(`select`?: number | (number, number)=0, `creator`?: string='author', `initials`?: boolean | \"only\"=false, `letters`?: number=0, `etal`?: string='', `joiner`?: string=' ', `min`?: number=0, `max`?: number=0)": "Author/editor information. Parameters are: - `creator`: select type of creator (`author` or `editor`), - `initials`: whether to add initials or to only use initials, - `letters`: pick this many letters from the name, defaults to 0 = all, - `select`: select these authors, number or range (inclusive); negative numbers mean \"from the end\", default = 0 = all, - `given`: use given name instead of family name, - `etal`: use this term to replace authors after `select` authors have been named, - `joiner`: use this character to join authors - `min`: skip to the next pattern if there are less than `min` creators - `min`: skip to the next pattern if there are more than `max` creators",
  "`authshort`(`creator`?: string='author', `initials`?: boolean=false, `joiner`?: string='.')": "The last name if one author is given; the first character of up to three authors' last names if more than one author is given. A plus character is added, if there are more than three authors.",
  "`date`(`format`?: string='%Y-%m-%d')": "The date of the publication",
  "`extra`(`variable`: string)": "A pseudo-field from the extra field. eg if you have `Original       date: 1970` in your `extra` field, you can get it as       `[extra=originalDate]`, or `tex.shortauthor: APA` which you could       get with `[extra=tex.shortauthor]`. Any `tex.` field will be       picked up, the other fields can be selected from [this       list](https://retorque.re/zotero-better-bibtex/exporting/extra-fields/)       of key names.",
  "`firstpage`": "The number of the first page of the publication (Caution: this will return the lowest number found in the pages field, since BibTeX allows `7,41,73--97` or `43+`.)",
  "`getField`(`name`: string)": "Gets the value of the item field",
  "`inspireHep`": "Fetches the key from inspire-hep based on DOI or arXiv ID",
  "`journal`(`abbrev`?: string='abbrev+auto')": "returns the journal abbreviation, or, if not found, the journal title, If 'automatic journal abbreviation' is enabled in the BBT settings, it will use the same abbreviation filter Zotero uses in the wordprocessor integration. You might want to use the `abbr` filter on this. Abbreviation behavior can be specified as `abbrev+auto` (the default) which uses the explicit journal abbreviation if present, and tries the automatic abbreviator if not (if auto-abbrev is enabled in the preferences), `auto` (skip explicit journal abbreviation even if present), `abbrev` (no auto-abbrev even if it is enabled in the preferences) or `off` (no abbrevation).",
  "`keyword`(`n`: number)": "Tag number `N`",
  "`language`(`name`: string...)": "Tests whether the item has the given language set, and skips to the next pattern if not",
  "`lastpage`": "The number of the last page of the publication (See the remark on `firstpage`)",
  "`len`(`relation`: string, `length`: number)": "If the length of the output does not match the given number, skip to the next pattern.",
  "`library`": "returns the name of the shared group library, or nothing if the item is in your personal library",
  "`month`": "the month of the publication",
  "`origdate`": "the original date of the publication",
  "`origyear`": "the original year of the publication",
  "`postfix`(`format`?: string='%(a)s', `start`?: number=0)": "a pseudo-function that sets the citekey disambiguation postfix using an <a href=\"https://www.npmjs.com/package/sprintf-js\">sprintf-js</a> format spec for when a key is generated that already exists. Does not add any text to the citekey otherwise. You *must* include *exactly* one of the placeholders `%(n)s`> (number), `%(a)s` (alpha, lowercase) or `e>%(A)s` (alpha, uppercase). For the rest of the disambiguator you can use things like padding and extra text as sprintf-js allows. With `+1` the disambiguator is always included, even if there is no need for it when no duplicates exist. The default  format is `%(a)s`.",
  "`shorttitle`(`n`?: number=3, `m`?: number=0)": "The first `N` (default: 3) words of the title, apply capitalization to first `M` (default: 0) of those",
  "`shortyear`": "The last 2 digits of the publication year",
  "`text`(`text`: string)": "Set the currennt chunk",
  "`title`": "Capitalize all the significant words of the title, and concatenate them. For example, `An awesome paper on JabRef` will become `AnAwesomePaperJabref`",
  "`type`(`allowed`: string...)": "Tests whether the item is of any of the given types",
  "`veryshorttitle`(`n`?: number=1, `m`?: number=0)": "The first `N` (default: 1) words of the title, apply capitalization to first `M` (default: 0) of those",
  "`year`": "The year of the publication",
  "`zotero`": "Generates citation keys as the stock Zotero Bib(La)TeX export does. Note that this pattern inherits all the problems of the original Zotero citekey generation -- you should really only use this if you have existing papers that rely on this behavior."
}