BetterBibTeX.startup.waitingForZotero=En attente de la base de donn\u00e9es Zotero
BetterBibTeX.startup.waitingForTranslators=En attente des convertisseurs Zotero
BetterBibTeX.startup.loadingKeys=Chargement des cl\u00e9s de citation
BetterBibTeX.startup.autoExport.load=Initialisation de l'export automatique
BetterBibTeX.startup.autoExport=D\u00e9marrage de l'exportation automatique
BetterBibTeX.startup.keyManager=D\u00e9marrage du gestionnaire de cl\u00e9s
BetterBibTeX.startup.serializationCache=D\u00e9marrage du cache de s\u00e9rialisation
BetterBibTeX.startup.journalAbbrev=Chargement des abr\u00e9viations du journal
BetterBibTeX.startup.dbUpgrade=Nettoyage de la base de donn\u00e9es {n}/{total}...
BetterBibTeX.startup.dbUpgrade.saving=Nettoyage de la base de donn\u00e9es, sauvegarde...
BetterBibTeX.startup.dbUpgrade.notEditable={n} \u00e9l\u00e9ments non mis \u00e0 jour car en lecture seule
BetterBibTeX.startup.installingTranslators=Installation des convertisseurs
BetterBibTeX.startup.installingTranslators.new=Better BibTeX \: nouveaux convertisseurs install\u00e9s
BetterBibTeX.startup.installingTranslators.new.DnD=De nouveaux convertisseurs Better BibTeX ont \u00e9t\u00e9 install\u00e9s. Si vous voulez les utiliser pour glisser-d\u00e9poser (par exemple pour glisser et d\u00e9poser des cl\u00e9s de citation ou des citations), vous devrez red\u00e9marrer une fois pour les activer.
BetterBibTeX.startup.installingTranslators.new.dontAskAgain=Ne plus le demander

BetterBibTeX.auxScan.title=Tagguer les r\u00e9f\u00e9rences cit\u00e9es dans le fichier AUX
BetterBibTeX.auxScan.prompt=Nom de tag

BetterBibTeX.texstudio.notfound=TeXstudio est introuvable dans {path}

Translate.error.target.notaFile={path} existe mais n\u2019est pas un fichier
Translate.error.target.noParent={path} n\u2019a pas de dossier parent

Preferences.auto-export.type.collection=Collection
Preferences.auto-export.type.library=Biblioth\u00e8que
Preferences.auto-export.status.scheduled=Planifi\u00e9
Preferences.auto-export.status.running=En cours...
Preferences.auto-export.status.done=Termin\u00e9
Preferences.auto-export.status.error=Erreur
Preferences.auto-export.git.message={type} mis \u00e0 jour par Better BibTeX pour Zotero
AutoExport.too-long.title=(Longue) exportation automatique en cours
AutoExport.too-long.body=Votre exportation automatique {translator} \u00e0 {path} a pris {seconds} secondes. Pendant les exportations de quelque type que ce soit, l''interface utilisateur de Zotero est verrouill\u00e9e.
AutoExport.too-long.primeEnabled=Pour minimiser les effets des exportations automatiques durant (trop) longtemps, la mise en place du cache a \u00e9t\u00e9 activ\u00e9e. Cela rendra les exportations automatiques plus lentes, mais r\u00e9duira au maximum le temps pendant lequel Zotero est inutilisable.
AutoExport.too-long.suggestIdle=Pour minimiser les effets des exportations automatiques durant (trop) longtemps, vous pouvez configurer l'exportation automatique en \u00ab Inactif \u00bb au lieu de \u00ab Imm\u00e9diat \u00bb.
AutoExport.too-long.sorry=Vous avez d\u00e9j\u00e0 activ\u00e9 la mise en place du cache, et l'exportation automatique est activ\u00e9e. Rien de plus ne peut \u00eatre fait sans un changement de l'architecture de Zotero (https\://u.nu/27e9).

exportOptions.keepUpdated=Garder \u00e0 jour
exportOptions.reminder=\u00cates-vous s\u00fbr de ne pas vouloir du format ''{translator}''?

ErrorReport.better-bibtex.current=Vous ex\u00e9cutez Better BibTeX version {version}
ErrorReport.better-bibtex.latest=La derni\u00e8re version de Better BibTeX est {version}
ErrorReport.better-bibtex.oom=Votre syst\u00e8me est probablement \u00e0 court de m\u00e9moire lors de l\u2019assemblage du fichier journal. Veuillez d\u00e9finir ''{preference}'' sur une valeur inf\u00e9rieure \u00e0 la {limit} actuelle, red\u00e9marrez et r\u00e9essayez.

xpi.description=Ajoute \u00e0 Zotero une compatibilit\u00e9 \u00e9tendue avec LaTeX

DB.corrupt=Une erreur s'est produite lors de l'ouverture de votre base de donn\u00e9es
DB.corrupt.explanation=Une erreur s''est produite lors de l''ouverture de votre base de donn\u00e9es. Cela pourrait signifier que votre base de donn\u00e9es est corrompue. L''erreur signal\u00e9e par Zotero est la suivante\: {error}.\n\nPour continuer, indiquez si vous souhaitez \:\n\n1. demander \u00e0 Zotero de restaurer une sauvegarde pr\u00e9c\u00e9dente en red\u00e9marrant maintenant ;\n2. r\u00e9initialiser la base de donn\u00e9es Better BibTeX et continuer\n3. quitter Zotero et solliciter l''assistance pour tenter de restaurer la base de donn\u00e9es.\n\nLa r\u00e9initialisation vous permettra de continuer, mais vos cl\u00e9s de citation seront r\u00e9g\u00e9n\u00e9r\u00e9es et les exportations automatiques devront \u00eatre configur\u00e9es \u00e0 nouveau. Une sauvegarde de la base de donn\u00e9es corrompue sera conserv\u00e9e au cas o\u00f9.
DB.corrupt.quit=Quitter Zotero maintenant
DB.corrupt.restore=Red\u00e9marrer Zotero et tenter de restaurer
DB.corrupt.reset=R\u00e9initialiser et continuer
